In [1]:
import os
import sys

root = os.path.dirname(os.path.abspath("."))
sys.path.append(root)

import numpy as np
import pandas as pd

import predikit as pk

# Test Load DataFrame

In [11]:
from io import BytesIO
from pathlib import Path


def load_show(path_or_buf, extension=None, n=3, label=None, **kwargs):
    df = pk.DataFrameParser(
        path_or_buf=path_or_buf,
        extension=extension,
        **kwargs,
    )  # type: ignore
    if label:
        display(f"From {label}")
    display(df.head(n))


# from a Buffered Input Stream
f = BytesIO(b"a,b,c\n1,2,3\n4,5,6\n7,8,9")
load_show(f, extension="csv", label="BytesIO")

# from a csv file
f = Path("./sample_data/airline_bumping.csv")
print(f)
load_show(f, n=4, label="csv")

# from a pickle file
f = Path("./sample_data/stations.pickle")
load_show(f, n=5, label="pickle")

# from a parquet file
f = Path("./sample_data/Flights 1m.parquet")
load_show(f, n=3, label="parquet")

# from a dictionary
data = {
    "Name": ["John", "Andrea", "Rose", "Linda", "Peter", "Meg"],
    "Age": [np.nan, 23, 25, 50, np.nan, 50],
    "Credit": [np.nan, 400, np.nan, 50, 200, np.nan],
}
load_show(data, n=3, label="dict")

# from a list of dictionaries
data = [
    {"Name": "John", "Age": np.nan, "Credit": np.nan},
    {"Name": "Andrea", "Age": 23, "Credit": 400},
    {"Name": "Rose", "Age": 25, "Credit": np.nan},
    {"Name": "Linda", "Age": 50, "Credit": 50},
    {"Name": "Peter", "Age": np.nan, "Credit": 200},
    {"Name": "Meg", "Age": 50, "Credit": np.nan},
]
load_show(data, label="list of dicts")

# from a dictionary of Series
data = {
    "one": pd.Series([1.0, 2.0, 3.0], index=["a", "b", "c"]),
    "two": pd.Series([1.0, 2.0, 3.0, 4.0], index=["a", "b", "c", "d"]),
}
load_show(data, label="dict of Series")

# from a 2d array
data = np.array(
    [
        ["John", "Andrea", "Rose", "Linda", "Peter", "Meg"],
        [np.nan, 23, 25, 50, np.nan, 50],
        [np.nan, 400, np.nan, 50, 200, np.nan],
    ]
)

data = data.T
load_show(data, label="2d array", columns=["Name", "Age", "Credit"])


# ToDo => add tests for JSON and EXCEL

'From BytesIO'

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

sample_data/airline_bumping.csv

'From csv'

           airline  year  nb_bumped  total_passengers
0  DELTA AIR LINES  2017        679          99796155
1   VIRGIN AMERICA  2017        165           6090029
2  JETBLUE AIRWAYS  2017       1475          27255038
3  UNITED AIRLINES  2017       2067          70030765

'From pickle'

  station_id        station_name                 location
0      40010  Austin-Forest Park  (41.870851, -87.776812)
1      40020         Harlem-Lake  (41.886848, -87.803176)
2      40030        Pulaski-Lake  (41.885412, -87.725404)
3      40040        Quincy/Wells   (41.878723, -87.63374)
4      40050               Davis   (42.04771, -87.683543)

'From parquet'

      FL_DATE  DEP_DELAY  ARR_DELAY  AIR_TIME  DISTANCE   DEP_TIME   ARR_TIME
0  2006-01-01          5         19       350      2475   9.083333  12.483334
1  2006-01-02        167        216       343      2475  11.783334  15.766666
2  2006-01-03         -7         -2       344      2475   8.883333  12.133333

'From dict'

     Name   Age  Credit
0    John   NaN     NaN
1  Andrea  23.0   400.0
2    Rose  25.0     NaN

'From list of dicts'

     Name   Age  Credit
0    John   NaN     NaN
1  Andrea  23.0   400.0
2    Rose  25.0     NaN

'From dict of Series'

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0

'From 2d array'

     Name  Age Credit
0    John  nan    nan
1  Andrea   23    400
2    Rose   25    nan

# Data Cleansing

## Handling Missing Values

In [3]:
def init_df():
    data = {
        "Name": ["John", "Andrea", "Rose", "Linda", "Peter", "Meg"],
        "Age": [np.nan, 200, 25, 50, np.nan, 50],
        "Credit": [np.nan, 400, np.nan, 200_00_00, 1_000_000, np.nan],
    }

    return pk.DataFrameParser(data)


df = init_df()
display(df)
# bug in MODE doesn't fill all NaNs
mvp = pk.MissingValuesProcessor(strategy=pk.MissingValueStrategy.CONSTANT)
# bug in Constant for float columns uses "missing_value" instead of 0
# print(df["Age"].dtype)
df = mvp.fit_transform(df)
# bug in Constant parses float columns as object
print(df["Age"].dtype)
# df

     Name    Age     Credit
0    John    NaN        NaN
1  Andrea  200.0      400.0
2    Rose   25.0        NaN
3   Linda   50.0  2000000.0
4   Peter    NaN  1000000.0
5     Meg   50.0        NaN

float64

## Handling Outliers

In [4]:
data = {
    "Name": ["John", "Andrea", "Rose", "Linda", "Peter", "Meg"],
    "Age": [np.nan, 200, 25, 50, np.nan, 50],
    "Credit": [2, 1_000_000, 2_000_000, 3_000_000, 1_500_000, 1_750_000],
}
df = pk.DataFrameParser(data)


display(df)
op = pk.OutliersProcessor(
    pk.OutlierDetectionMethod.Z_SCORE,
    threshold=3,
    verbose=True,
    add_indicator=True,
)
df = op.fit_transform(df, columns=["Credit"])

df

     Name    Age   Credit
0    John    NaN        2
1  Andrea  200.0  1000000
2    Rose   25.0  2000000
3   Linda   50.0  3000000
4   Peter    NaN  1500000
5     Meg   50.0  1750000

     Name    Age   Credit  Credit_isOutlier_Z_SCORE
0    John    NaN        2                         0
1  Andrea  200.0  1000000                         0
2    Rose   25.0  2000000                         0
3   Linda   50.0  3000000                         0
4   Peter    NaN  1500000                         0
5     Meg   50.0  1750000                         0

# Encoding Features

In [5]:
enc = pk.EncodingProcessor(
    pk.CategoricalEncodingStrategies.OneHotEncoder,
    verbose=True,
    sparse_output=True,
)
cols = ["Name"]
enc.fit_transform(df, columns=cols)

,Age,Credit,Credit_isOutlier_Z_SCORE,Name_Andrea,Name_John,Name_Linda,Name_Meg,Name_Peter,Name_Rose
0,NaN,2,0,0.0,1.0,0.0,0.0,0.0,0.0
1,200.0,1000000,0,1.0,0.0,0.0,0.0,0.0,0.0
2,25.0,2000000,0,0.0,0.0,0.0,0.0,0.0,1.0
3,50.0,3000000,0,0.0,0.0,1.0,0.0,0.0,0.0
4,NaN,1500000,0,0.0,0.0,0.0,0.0,1.0,0.0
5,50.0,1750000,0,0.0,0.0,0.0,1.0,0.0,0.0

# Filtering Data

In [6]:
df = init_df()
bf = pk.BasicFilteringProcessor(
    pk.FilterOperator.EQUAL,
    "50",
    case_sensitive=False,
    verbose=True,
)

bf.fit_transform(df, column="Age")
# bf
# display(df)

# bf.set_params(operator=pk.FilterOperator.EQUAL, value=50)
# display(bf.fit_transform(df, column="Age"))

2023-12-13 07:36:44,860 (data_filtering.py:88) - INFO: Filtering data by => [Age == 50]

    Name   Age     Credit
3  Linda  50.0  2000000.0
5    Meg  50.0        NaN

# String Modifications

In [7]:
data = {
    "Name": [
        "   John   .!,@  ",
        "#A nd@rea$",
        "Rose",
        "L0ind9a",
        "P!e1t@e_r",
        "M+e - g$",
    ],
    "Age": [np.nan, 200, 25, 50, np.nan, 50],
    "Credit": [np.nan, 400, np.nan, 200_00_00, 1_000_000, np.nan],
}
df = pk.DataFrameParser(data)

sop = pk.StringOperationsProcessor(
    pk.CaseModifyingMethod.TITLE,
    trim=True,
    remove_letters=False,
    remove_whitespace=True,
    remove_numbers=True,
    remove_punctuation=True,
    verbose=False,
)


display(df)
sop.fit_transform(df, columns=["Name"])

               Name    Age     Credit
0     John   .!,@      NaN        NaN
1        #A nd@rea$  200.0      400.0
2              Rose   25.0        NaN
3           L0ind9a   50.0  2000000.0
4         P!e1t@e_r    NaN  1000000.0
5          M+e - g$   50.0        NaN

     Name    Age     Credit
0    John    NaN        NaN
1  Andrea  200.0      400.0
2    Rose   25.0        NaN
3   Linda   50.0  2000000.0
4   Peter    NaN  1000000.0
5     Meg   50.0        NaN

# Output Dataset

In [8]:
import platform

print(f"Running on {platform.system()}")

# cross platform
dfe = pk.DataFrameExporter(df, extension=pk.FileExtension.CSV)
dfe.export()

2023-12-13 07:36:44,939 (output.py:87) - INFO: Exporting to /home/mghali/predikit_out/out.csv ...

Running on Linux